AlertInfo
| where <add some filter here for a certain alert>
| join AlertEvidence on $left.AlertId == $right.AlertId
| join (DeviceInfo | where OnboardingStatus != "Onboarded") on $left.DeviceId == $right.DeviceId
//assumption is not-onboarded devices are not secured and as such we'd like to see that seperately 
